<?php

use yii\db\Migration;

/**
 * Class m181127_094736_create_conf_recharge
 */
class m181127_094736_create_conf_recharge extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('conf_recharge', [
            'id' => \yii\db\Schema::TYPE_UPK,
            'channel_id' => $this->string(20)->notNull()->comment('渠道ID'),
            'game_id' => $this->integer()->unsigned()->notNull()->comment('游戏ID'),
            'category' => $this->integer()->unsigned()->notNull()->comment('商品类别、10、50、100、300、500、1000充值、0活动'),
            'num' => $this->integer()->unsigned()->notNull()->comment('商品数量'),
            'price' => $this->decimal(10,2)->unsigned()->notNull()->comment('商品价格'),
            'goods_name' => $this->string(20)->notNull()->comment('商品名称'),
            'type' => $this->tinyInteger()->unsigned()->notNull()->comment('商品类型、1商城产品、2、其他产品'),
            'is_activity' => $this->tinyInteger()->unsigned()->notNull()->comment('是否活动、0不是、1是'),
            'activity_id' => $this->tinyInteger()->unsigned()->notNull()->comment('活动ID'),
            'explain' => $this->string(20)->notNull()->comment('说明'),
        ]);

        $this->batchInsert('conf_recharge', [
            'channel_id',
            'game_id',
            'category',
            'num',
            'price',
            'goods_name',
            'type',
            'is_activity',
            'activity_id',
            'explain',
        ], [
            [1, 1114112, 10, 1001, 10.01, '商品10', 1, 0, 0, '10.01元1001元宝'],
            [1, 1114112, 10, 1002, 10.02, '商品10', 1, 0, 0, '10.02元1002元宝'],
            [1, 1114112, 10, 1003, 10.03, '商品10', 1, 0, 0, '10.03元1003元宝'],
            [1, 1114112, 10, 1004, 10.04, '商品10', 1, 0, 0, '10.04元1004元宝'],
            [1, 1114112, 10, 1005, 10.05, '商品10', 1, 0, 0, '10.05元1005元宝'],

            [1, 1114112, 50, 5001, 50.01, '商品50', 1, 0, 0, '50.01元5001元宝'],
            [1, 1114112, 50, 5002, 50.02, '商品50', 1, 0, 0, '50.02元5002元宝'],
            [1, 1114112, 50, 5003, 50.03, '商品50', 1, 0, 0, '50.03元5003元宝'],
            [1, 1114112, 50, 5004, 50.04, '商品50', 1, 0, 0, '50.04元5004元宝'],
            [1, 1114112, 50, 5005, 50.05, '商品50', 1, 0, 0, '50.05元5005元宝'],

            [1, 1114112, 100, 10001, 100.01, '商品100', 1, 0, 0, '100.01元10001元宝'],
            [1, 1114112, 100, 10002, 100.02, '商品100', 1, 0, 0, '100.02元10002元宝'],
            [1, 1114112, 100, 10003, 100.03, '商品100', 1, 0, 0, '100.03元10003元宝'],
            [1, 1114112, 100, 10004, 100.04, '商品100', 1, 0, 0, '100.04元10004元宝'],
            [1, 1114112, 100, 10005, 100.05, '商品100', 1, 0, 0, '100.05元10005元宝'],

            [1, 1114112, 300, 30001, 300.01, '商品300', 1, 0, 0, '300.01元30001元宝'],
            [1, 1114112, 300, 30002, 300.02, '商品300', 1, 0, 0, '300.02元30002元宝'],
            [1, 1114112, 300, 30003, 300.03, '商品300', 1, 0, 0, '300.03元30003元宝'],
            [1, 1114112, 300, 30004, 300.04, '商品300', 1, 0, 0, '300.04元30004元宝'],
            [1, 1114112, 300, 30005, 300.05, '商品300', 1, 0, 0, '300.05元30005元宝'],

            [1, 1114112, 500, 50001, 500.01, '商品500', 1, 0, 0, '500.01元50001元宝'],
            [1, 1114112, 500, 50002, 500.02, '商品500', 1, 0, 0, '500.02元50002元宝'],
            [1, 1114112, 500, 50003, 500.03, '商品500', 1, 0, 0, '500.03元50003元宝'],
            [1, 1114112, 500, 50004, 500.04, '商品500', 1, 0, 0, '500.04元50004元宝'],
            [1, 1114112, 500, 50005, 500.05, '商品500', 1, 0, 0, '500.05元50005元宝'],

            [1, 1114112, 1000, 100001, 1000.01, '商品1000', 1, 0, 0, '1000.01元100001元宝'],
            [1, 1114112, 1000, 100002, 1000.02, '商品1000', 1, 0, 0, '1000.02元100002元宝'],
            [1, 1114112, 1000, 100003, 1000.03, '商品1000', 1, 0, 0, '1000.03元100003元宝'],
            [1, 1114112, 1000, 100004, 1000.04, '商品1000', 1, 0, 0, '1000.04元100004元宝'],
            [1, 1114112, 1000, 100005, 1000.05, '商品1000', 1, 0, 0, '1000.05元100005元宝'],

            [1, 1114112, 0, 1000, 8, '商品8', 2, 1, 1, '8元1000元宝'],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('conf_recharge');
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m181127_094736_create_conf_recharge cannot be reverted.\n";

        return false;
    }
    */
}
