一拳娱乐代理学堂







日期	内容	版本号	审核人	撰写人

































1.一拳娱乐代理学堂

2018年12月1日修订

如果您是刚被开通成为我们一拳娱乐的新代理，强烈建议您花10分钟仔细阅读以下一拳娱乐代理学堂的内容，我们保证很快您将成为代理老司机，顺利走上躺赚之路！！！



1.1制度简介
2018年12月1日修订

1.一拳娱乐是基于线上真人竞技模式的网上棋牌室，绿色安全，公平稳定，只要会使用手机，无需任何成本，人人皆可创业。
2.成为代理后，可以通过游戏内分享，代理后台保存推广二维码等方式，宣传您专属的推广二维码广告图，邀请玩家扫码下载游戏。
3.玩家一旦通过扫描某代理的二维码进入游戏，则将终身被绑定为该代理的下级玩家，代理可以根据情况，酌情为自己的玩家从代理后台为其开通代理，成为自己的下级代理。
4.一拳娱乐实行无限代理模式，不限制发展代理数量，不限制代理层数，只要是你渠道下的用户所产生的消耗都将计算到你的业绩当中，每周根据你所产生的业绩所达到的代理等级进行返利，最高返利比例可达到80%。
5.每个代理将有双重收益来源，第一重收益来源：每周根据业绩所达到的代理等级，你将获得：你的直属玩家消耗*等级对应返利比例。 第二重收益来源：每周根据业绩所达的代理等级，你将获得：对应直属代理的业绩*你与对应直属代理的返利比例差。

1.2产品优势
2018年12月1日修订

1.一拳娱乐采用棋牌类产品最先进的3.0模式，可私密建房，亦可随时加入陌生房间，随时开局，不用等人，不用频繁换群，不封号，更没有任何风险。
2.一拳娱乐是由前腾讯团队倾力打造的一款高品质风格化棋牌游戏产品，秉承业内最安全，最稳定，最公平的研发原则，加上公司强大的资金，推广运营实力，必将成为国内真人竞技品类最强大的平台之一，早加入早赚钱。
3.针对目前市场上现存相同玩法的房卡类游戏法律风险过大而且容易被封群封号的问题，成为一拳娱乐的代理完全不用担心这些，一拳娱乐线上充值购买元宝，公司收入及代理返利合法纳税，不会有任何法律风险，更不会被封群封号。
4一拳娱乐代理模式，一日成为代理终身受益，秉承与代理共同发展的理念，不限制代理发展，不限制代理收益，只要您努力，躺赚不是梦！


1.3成为代理后怎么赚钱
2018年12月1日修订

1.发展下级玩家：因为你的下级玩家可以为您直接提供自身消耗的(30%-80%)的高额返利，成为代理后，在游戏内通过”分享”功能将自己专属的推广二维码发到朋友圈，或者进入代理后台-推广二维码中将二维码广告图保存下来发给亲朋好友，都是最直接可以获取下级玩家的方法。
2.发展下级代理：多发展下级代理，因为你渠道下玩家的消耗都将计算至您的业绩中，代理越多你渠道业绩就会越多，你的代理等级就越高，最终结算的分成比例就越高，那么你就可以拿到你的直属代理业绩*你与对应直属代理的返利比例差的收益。所以真正的躺赚，从寻找优质下级代理开始吧！


1.4赠么开通下级代理
2018年12月1日修订

1.您可以自助在”一拳娱乐”公众号的代理后台-开通代理功能中，将您的下级玩家(必须下载并且登陆过游戏)开通成为下级代理。
2.可开通代理的数量是无限制的，只要您有玩家都可开通成为您的代理，不限制您的发展，支持您赚钱。

1.5周入过万小诀窍
2018年12月1日修订
1.好友扫码后即会绑定成为你的永久下级，但他们往往会忘记下载登录游戏，您可以在代理后台-我的玩家功能中观察他们的登陆状态，如果一直显示未登录，可以尝试联系他们尽快下载游戏登陆哟。
2.刚被开通成为代理的下级代理，往往不知道怎么进入代理后台开启他的代理扩张之路，这时候需要把我们”一拳娱乐”的公众号分享给他，告知点击右下角代理后台即可。
3.对下级代理进行一些必要的业务指导能大大加速这些新司机上路。
4.坚持不懈，积少成多，是我们见到的最容易成功的代理品质。

1.6代理等级及返利比例说明
2018年12月1日修订
1.无限代返利制度表
代理级别	业绩额度(元)	返利比例
V1	0——10000	30%
V2	10001——20000	35%
V3	20001——50000	40%
V4	50001——100000	45%
V5	100001——200000	50%
V6	200001——400000	60%
V7	400001——800000	70%
V8	800000以上	80%
上表中每个等级的最高值还属于当前等级，高于最高值则为下一等级

2.返利说明
业绩：您伞下所有用户消耗的服务费统称为业绩。
服务费为游戏底注的40%~50%(百人场游戏为每局赢的货币*5%)
收益：每周根据代理的业绩为代理定级，那么收益为：
直属万家消耗*对应返利比例+直属代理业绩*返利比例差
3.收益模拟
例：您当月业绩为85万(V8),其中下级代理A和B分别为35万(V6)，20万(V5);直属玩家C消耗为30万。
那么A最终可获得收益为：如下计算
35万*(80%-60%)+20万*(80%-50%)+30万*80%=37万